//Motor.c
//

/*********************************************
;* 技术参数				24BYJ48 						28BYJ48
;* 电压						5V								5V
;* 相数						4
;* 相电阻					300R
;* 步距角度				5.625/64
;* 减速比					1:64
;* 启动转矩				>300
;* 启动频率				>550
;* 24表示有效最大外径24mm，B步进，Y永磁式，J减速型，48四相八拍
;********************************************/

/*********************************************
;* 1-2相励磁顺序表
;* 连线序号		导线颜色		分配顺序
;* 1					红					+	+	+	+	+	+	+	+
;* 2					黑					-	-						-
;* 3					黄						-	-	-
;* 4					棕								-	-	-
;* 5					蓝										-	-	-
;* 
;* 也就是 A->AB->B->B->BC->C->CD->D->DA
;********************************************/

/*********************************************
;* Include headfiles 
;********************************************/
#include"init.h"

//假定A B C D四组线圈对应PA0 PA1 PA2 PA3
#if 1
u8	Smotp[]	= {0x08, 0x0C, 0x04, 0x06, 0x02, 0x03, 0x01, 0x09};		//Smot正表
u8	Smotn[]	= {0x09, 0x01, 0x03, 0x02, 0x06, 0x04, 0x0C, 0x08};		//Smot反表
#endif


/*********************************************
;* Private variables 
;********************************************/


/**********************************************
;* 
;* Fun:  
;* Arg:		None
;* Ret:		None
;* Des:
;*	
;**********************************************/

void SwayMot_Init(void)
{


}


/**********************************************
;* 
;* Fun:  
;* Arg:		None
;* Ret:		None
;* Des:		此处，假定A B C D四组线圈对应PA0 PA1 PA2 PA3
;*
;**********************************************/
void SwayMot_Foreward(void)
{
	u8 i, j;
	for(i=0, j=0; i<100; i++, j++) {	//i表示转到指定位置时需要的脉冲个数，由实际调试结果定
		PA = 0;						//这里的两步在调试时看是否能并成一步
		PA = Smotp[j++];
		j &= 0x08;
		NOP();						//延迟越小，转速越大，力矩越小，该时间需要调试确定
		NOP();

	}

}

/**********************************************
;* 
;* Fun:  
;* Arg:		None
;* Ret:		None
;* Des:
;*	
;**********************************************/
void SwayMot_Reverse(void)
{


}

/**********************************************
;* 
;* Fun:  
;* Arg:		None
;* Ret:		None
;* Des:
;*	
;**********************************************/
void SwayMot_Shutoff(void)
{


}


/**********************************************
;* 
;* Fun:  
;* Arg:		None
;* Ret:		None
;* Des:
;*	
;**********************************************/
void SwayControl(u8 lvl)
{


}



/**********************************************
;* 
;* Fun:  
;* Arg:		None
;* Ret:		None
;* Des:
;*	
;**********************************************/

void LeafMot_Init(void)
{

}


/**********************************************
;* 
;* Fun:  
;* Arg:		None
;* Ret:		None
;* Des:
;*	
;**********************************************/

void LeafControl(u8 spd)
{
	switch(spd) {
		case LeafLevel_0: {
		
		} break;

		default: {
		
		} break;		
	}
}
